FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_Keil/System_XMC4500.c
/* Setup the clockout */
    #if SCU_CLOCKOUT_SETUP
        SCU_CLK->EXTCLKCR |= SCU_CLOCKOUT_SOURCE;
/*set PLL div for clkout */
        SCU_CLK->EXTCLKCR |= SCU_CLOCKOUT_DIV << 16;

        if( SCU_CLOCKOUT_PIN )
        {
            PORT0->IOCR8 = 0x00000088;               /*P0.8 --> ALT1 select +  HWSEL */
            PORT0->HWSEL &= ( ~PORT0_HWSEL_HW8_Msk );
            /*PORT0->PDR1 &= (~PORT0_PDR1_PD8_Msk);  / *set to strong driver * / */
        }
        else
        {
            PORT1->IOCR12 = 0x88000000;                /*P1.15--> ALT1 select */
            /*PORT1->PDR1 &= (~PORT1_PDR1_PD15_Msk);  / *set to strong driver * / */
        }
    #endif /* if SCU_CLOCKOUT_SETUP */


/* Setup the System clock */
    #if SCU_CLOCK_SETUP
        SystemClockSetup();
    #endif

/*----------------------------------------------------------------------------
 * Clock Variable definitions
 *----------------------------------------------------------------------------*/
    SystemCoreClockUpdate(); /*!< System Clock Frequency (Core Clock)*/


/* Setup the USB PL */
    #if SCU_USB_CLOCK_SETUP
        USBClockSetup();
    #endif
}


/**
 * @brief  Update SystemCoreClock according to Clock Register Values
 * @note   -
 * @param  None
 * @retval None
 */
void SystemCoreClockUpdate( void )
{
    unsigned int PDIV;
    unsigned int NDIV;
    unsigned int K2DIV;
    unsigned int long VCO;


/*----------------------------------------------------------------------------
 * Clock Variable definitions
 *----------------------------------------------------------------------------*/
    if( SCU_CLK->SYSCLKCR == 0x00010000 )
    {
        if( SCU_PLL->PLLSTAT & SCU_PLL_PLLSTAT_VCOLOCK_Msk )
        {
            /* check if PLL is locked */
            /* read back divider settings */
            PDIV = ( ( SCU_PLL->PLLCON1 & SCU_PLL_PLLCON1_PDIV_Msk ) >> 24 ) + 1;
            NDIV = ( ( SCU_PLL->PLLCON1 & SCU_PLL_PLLCON1_NDIV_Msk ) >> 8 ) + 1;
            K2DIV = ( ( SCU_PLL->PLLCON1 & SCU_PLL_PLLCON1_K2DIV_Msk ) >> 16 ) + 1;

            if( SCU_PLL->PLLCON2 & SCU_PLL_PLLCON2_PINSEL_Msk )
            {
                /* the selected clock is the Backup clock fofi */
                VCO = ( CLOCK_BACK_UP / PDIV ) * NDIV;
                SystemCoreClock = VCO / K2DIV;
                /* in case the sysclock div is used */
                SystemCoreClock = SystemCoreClock / ( ( SCU_CLK->SYSCLKCR & SCU_CLK_SYSCLKCR_SYSDIV_Msk ) + 1 );
            }
            else
            {
                /* the selected clock is the PLL external oscillator */
                VCO = ( CLOCK_CRYSTAL_FREQUENCY / PDIV ) * NDIV;
                SystemCoreClock = VCO / K2DIV;
                /* in case the sysclock div is used */
                SystemCoreClock = SystemCoreClock / ( ( SCU_CLK->SYSCLKCR & SCU_CLK_SYSCLKCR_SYSDIV_Msk ) + 1 );
            }
        }
    }
    else
    {
        SystemCoreClock = CLOCK_BACK_UP;
    }
}


/**
 * @brief  -
 * @note   -
 * @param  None
 * @retval None
 */
#if ( SCU_CLOCK_SETUP == 1 )
    static int SystemClockSetup( void )
    {
        int temp;
        unsigned int long VCO;
        int stepping_K2DIV;

/* this weak function enables DAVE3 clock App usage */
        if( AllowPLLInitByStartup() )
        {
/* check if PLL is switched on */
            if( ( SCU_PLL->PLLCON0 & ( SCU_PLL_PLLCON0_VCOPWD_Msk | SCU_PLL_PLLCON0_PLLPWD_Msk ) ) != 0 )
            {
/* enable PLL first */
                SCU_PLL->PLLCON0 &= ~( SCU_PLL_PLLCON0_VCOPWD_Msk | SCU_PLL_PLLCON0_PLLPWD_Msk );
            }

/* Enable OSC_HP if not already on*/
            if( SCU_PLL_CLOCK_INPUT == SCU_CLOCK_CRYSTAL )
            {
                /********************************************************************************************************************/
                /*   Use external crystal for PLL clock input                                                                            */
                /********************************************************************************************************************/

                if( SCU_OSC->OSCHPCTRL & SCU_OSC_OSCHPCTRL_MODE_Msk )
                {
                    SCU_OSC->OSCHPCTRL &= ~( SCU_OSC_HP_MODE ); /*enable the OSC_HP*/
                    /* setup OSC WDG devider */
                    SCU_OSC->OSCHPCTRL |= ( SCU_OSCHPWDGDIV << 16 );
                    /* select external OSC as PLL input */
                    SCU_PLL->PLLCON2 &= ~SCU_PLL_PLLCON2_PINSEL_Msk;
                    /* restart OSC Watchdog */
                    SCU_PLL->PLLCON0 &= ~SCU_PLL_PLLCON0_OSCRES_Msk;

                    /* Timeout for wait loop ~150ms */
                    /********************************/
                    SysTick->LOAD = ( ( 5000000 + 100 ) & SysTick_LOAD_RELOAD_Msk ) - 1; /* set reload register */
                    SysTick->VAL = 0;                                                    /* Load the SysTick Counter Value */
                    SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk |
                                    SysTick_CTRL_ENABLE_Msk;                             /* Enable SysTick IRQ and SysTick Timer */

                    do
                    {
                        /* wait for ~150ms  */
                    } while( ( ( ( SCU_PLL->PLLSTAT ) & ( SCU_PLL_PLLSTAT_PLLHV_Msk | SCU_PLL_PLLSTAT_PLLLV_Msk | SCU_PLL_PLLSTAT_PLLSP_Msk ) ) != 0x380 ) && ( SysTick->VAL >= 500 ) );

                    SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;     /* Stop SysTick Timer */

                    if( ( ( SCU_PLL->PLLSTAT ) & ( SCU_PLL_PLLSTAT_PLLHV_Msk | SCU_PLL_PLLSTAT_PLLLV_Msk | SCU_PLL_PLLSTAT_PLLSP_Msk ) ) != 0x380 )
                    {
                        return( 0 ); /* Return Error */
                    }
                }
            }
            else if( SCU_PLL_CLOCK_INPUT == SCU_CLOCK_BACK_UP_FACTORY )
            {
                /********************************************************************************************************************/
                /*   Use factory trimming Back-up clock for PLL clock input                                                                            */
                /********************************************************************************************************************/
                /* PLL Back up clock selected */
                SCU_PLL->PLLCON2 |= SCU_PLL_PLLCON2_PINSEL_Msk;
            }
            else if( SCU_PLL_CLOCK_INPUT == SCU_CLOCK_BACK_UP_AUTOMATIC )
            {
                /********************************************************************************************************************/
                /*   Use automatic trimming Back-up clock for PLL clock input                                                                            */
                /********************************************************************************************************************/
                /* check for HIB Domain enabled  */
                if( ( SCU_POWER->PWRSTAT & SCU_POWER_PWRSTAT_HIBEN_Msk ) == 0 )
                {
                    SCU_POWER->PWRSET |= SCU_POWER_PWRSET_HIB_Msk; /*enable Hibernate domain*/
                }

                /* check for HIB Domain is not in reset state  */
                if( ( SCU_RESET->RSTSTAT & SCU_RESET_RSTSTAT_HIBRS_Msk ) == 1 )
                {
                    SCU_RESET->RSTCLR |= SCU_RESET_RSTCLR_HIBRS_Msk; /*de-assert hibernate reset*/
                }

                /* PLL Back up clock selected */
                SCU_PLL->PLLCON2 |= SCU_PLL_PLLCON2_PINSEL_Msk;

                if( SCU_STANDBY_CLOCK == HIB_CLOCK_FOSI )
                {
                    /****************************************************************************************************************/
                    /*   Use fOSI as source of the standby clock                                                                             */
                    /****************************************************************************************************************/
                    SCU_HIBERNATE->HDCR &= ~SCU_HIBERNATE_HDCR_STDBYSEL_Msk;

                    SCU_PLL->PLLCON0 &= ~SCU_PLL_PLLCON0_FOTR_Msk;

