FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_Keil/System_XMC4500.c
                    for( temp = 0; temp <= 0xFFFF; temp++ )
                    {
                    }

                    SCU_PLL->PLLCON0 |= SCU_PLL_PLLCON0_AOTREN_Msk;
                }
                else if( SCU_STANDBY_CLOCK == HIB_CLOCK_OSCULP )
                {
                    /****************************************************************************************************************/
                    /*   Use fULP as source of the standby clock                                                                            */
                    /****************************************************************************************************************/
                    /*check OSCUL if running correct*/
                    if( ( SCU_HIBERNATE->OSCULCTRL & SCU_HIBERNATE_OSCULCTRL_MODE_Msk ) != 0 )
                    {
                        while( SCU_GENERAL->MIRRSTS & SCU_GENERAL_MIRRSTS_OSCULCTRL_Msk )
                        {
                        }

                        SCU_HIBERNATE->OSCULCTRL &= ~SCU_HIBERNATE_OSCULCTRL_MODE_Msk; /*enable OSCUL*/
                        /*now ceck if the clock is OK using OSCULP Oscillator Watchdog (ULPWDG)*/
                        /* select OSCUL clock for RTC*/
                        SCU_HIBERNATE->HDCR |= SCU_HIBERNATE_HDCR_RCS_Msk;

                        while( SCU_GENERAL->MIRRSTS & SCU_GENERAL_MIRRSTS_HDCR_Msk )
                        {
                        }

                        /*enable OSCULP WDG Alarm Enable*/
                        SCU_HIBERNATE->HDCR |= SCU_HIBERNATE_HDCR_ULPWDGEN_Msk;

                        while( SCU_GENERAL->MIRRSTS & SCU_GENERAL_MIRRSTS_HDCR_Msk )
                        {
                        }

                        /*wait now for clock is stable */
                        do
                        {
                            SCU_HIBERNATE->HDCLR |= SCU_HIBERNATE_HDCLR_ULPWDG_Msk;

                            while( SCU_GENERAL->MIRRSTS & SCU_GENERAL_MIRRSTS_HDCLR_Msk )
                            {
                            }

                            for( temp = 0; temp <= 0xFFFF; temp++ )
                            {
                            }
                        }
                        while( ( SCU_HIBERNATE->HDSTAT & SCU_HIBERNATE_HDSTAT_ULPWDG_Msk ) == SCU_HIBERNATE_HDSTAT_ULPWDG_Msk );

                        SCU_HIBERNATE->HDCLR |= SCU_HIBERNATE_HDCLR_ULPWDG_Msk;

                        while( SCU_GENERAL->MIRRSTS & SCU_GENERAL_MIRRSTS_HDCLR_Msk )
                        {
                        }
                    }

                    /* now OSCULP is running and can be used */
                    SCU_HIBERNATE->HDCR |= SCU_HIBERNATE_HDCR_STDBYSEL_Msk;

                    while( SCU_GENERAL->MIRRSTS & SCU_GENERAL_MIRRSTS_HDCR_Msk )
                    {
                    }

                    SCU_PLL->PLLCON0 &= ~SCU_PLL_PLLCON0_FOTR_Msk;

                    /*TRIAL for delay loop*/
                    for( temp = 0; temp <= 0xFFFF; temp++ )
                    {
                    }

                    SCU_PLL->PLLCON0 |= SCU_PLL_PLLCON0_AOTREN_Msk;

                    /*TRIAL for delay loop*/
                    for( temp = 0; temp <= 0xFFFF; temp++ )
                    {
                    }
                }
            }

            /********************************************************************************************************************/
            /*   Setup and look the main PLL                                                                                    */
            /********************************************************************************************************************/

            if( !( SCU_PLL->PLLSTAT & SCU_PLL_PLLSTAT_VCOLOCK_Msk ) )
            {
                /* Systen is still running from internal clock */
                /* select FOFI as system clock */
                if( ( SCU_CLK->SYSCLKCR & SCU_CLK_SYSCLKCR_SYSSEL_Msk ) != 0x0 )
                {
                    SCU_CLK->SYSCLKCR &= ~SCU_CLK_SYSCLKCR_SYSSEL_Msk;                                                    /*Select FOFI*/
                }

                /*calulation for stepping*/
                if( SCU_PLL_CLOCK_INPUT == SCU_CLOCK_CRYSTAL )
                {
                    VCO = ( CLOCK_CRYSTAL_FREQUENCY / ( SCU_PLL_PDIV + 1 ) ) * ( SCU_PLL_NDIV + 1 );
                }

                if( ( SCU_PLL_CLOCK_INPUT == SCU_CLOCK_BACK_UP_AUTOMATIC ) || ( SCU_PLL_CLOCK_INPUT == SCU_CLOCK_BACK_UP_FACTORY ) )
                {
                    VCO = ( CLOCK_BACK_UP / ( SCU_PLL_PDIV + 1 ) ) * ( SCU_PLL_NDIV + 1 );
                }

                stepping_K2DIV = ( VCO / 24000000 ) - 1;
                /* Go to bypass the Main PLL */
                SCU_PLL->PLLCON0 |= SCU_PLL_PLLCON0_VCOBYP_Msk;
                /* disconnect OSC_HP to PLL */
                SCU_PLL->PLLCON0 |= SCU_PLL_PLLCON0_FINDIS_Msk;
                /* Setup devider settings for main PLL */
                SCU_PLL->PLLCON1 = ( ( SCU_PLL_K1DIV ) | ( SCU_PLL_NDIV << 8 ) | ( stepping_K2DIV << 16 ) | ( SCU_PLL_PDIV << 24 ) );
                /* we may have to set OSCDISCDIS */
                SCU_PLL->PLLCON0 |= SCU_PLL_PLLCON0_OSCDISCDIS_Msk;
                /* connect OSC_HP to PLL */
                SCU_PLL->PLLCON0 &= ~SCU_PLL_PLLCON0_FINDIS_Msk;
                /* restart PLL Lock detection */
                SCU_PLL->PLLCON0 |= SCU_PLL_PLLCON0_RESLD_Msk;
                /* wait for PLL Lock */
                /* setup time out loop */
                /* Timeout for wait loo ~150ms */
                /********************************/
                SysTick->LOAD = ( ( 5000000 + 100 ) & SysTick_LOAD_RELOAD_Msk ) - 1; /* set reload register */
                SysTick->VAL = 0;                                                    /* Load the SysTick Counter Value */
                SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk |
                                SysTick_CTRL_ENABLE_Msk;                             /* Enable SysTick IRQ and SysTick Timer */

                while( ( !( SCU_PLL->PLLSTAT & SCU_PLL_PLLSTAT_VCOLOCK_Msk ) ) && ( SysTick->VAL >= 500 ) )
                {
                }

                SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;             /* Stop SysTick Timer */

                if( ( SCU_PLL->PLLSTAT & SCU_PLL_PLLSTAT_VCOLOCK_Msk ) == SCU_PLL_PLLSTAT_VCOLOCK_Msk )
                {
                    /* Go back to the Main PLL */
                    SCU_PLL->PLLCON0 &= ~SCU_PLL_PLLCON0_VCOBYP_Msk;
                }
                else
                {
                    return( 0 );
                }

                /*********************************************************
                *  here we need to setup the system clock divider
                *********************************************************/

                SCU_CLK->CPUCLKCR = SCU_CPUCLKCR_DIV;
                SCU_CLK->PBCLKCR = SCU_PBCLKCR_DIV;
                SCU_CLK->CCUCLKCR = SCU_CCUCLKCR_DIV;


                /* Switch system clock to PLL */
                SCU_CLK->SYSCLKCR |= 0x00010000;

                /* we may have to reset OSCDISCDIS */
                SCU_PLL->PLLCON0 &= ~SCU_PLL_PLLCON0_OSCDISCDIS_Msk;


                /*********************************************************/
                /* Delay for next K2 step ~50탎 */
                /*********************************************************/
                SysTick->LOAD = ( ( 1250 + 100 ) & SysTick_LOAD_RELOAD_Msk ) - 1; /* set reload register */
                SysTick->VAL = 0;                                                 /* Load the SysTick Counter Value */
                SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk |
                                SysTick_CTRL_ENABLE_Msk;                          /* Enable SysTick IRQ and SysTick Timer */

                while( SysTick->VAL >= 100 )                                      /* wait for ~50탎  */
                {
                }

