FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_Keil/System_XMC4500.c
                SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;           /* Stop SysTick Timer */
                /*********************************************************/

                /*********************************************************
                *  here the ramp up of the system clock starts FSys < 60MHz
                *********************************************************/
                if( CLOCK_FSYS > 60000000 )
                {
                    /*calulation for stepping*/
                    if( SCU_PLL_CLOCK_INPUT == SCU_CLOCK_CRYSTAL )
                    {
                        VCO = ( CLOCK_CRYSTAL_FREQUENCY / ( SCU_PLL_PDIV + 1 ) ) * ( SCU_PLL_NDIV + 1 );
                    }

                    if( ( SCU_PLL_CLOCK_INPUT == SCU_CLOCK_BACK_UP_AUTOMATIC ) || ( SCU_PLL_CLOCK_INPUT == SCU_CLOCK_BACK_UP_FACTORY ) )
                    {
                        VCO = ( CLOCK_BACK_UP / ( SCU_PLL_PDIV + 1 ) ) * ( SCU_PLL_NDIV + 1 );
                    }

                    stepping_K2DIV = ( VCO / 60000000 ) - 1;

                    /* Setup devider settings for main PLL */
                    SCU_PLL->PLLCON1 = ( ( SCU_PLL_K1DIV ) | ( SCU_PLL_NDIV << 8 ) | ( stepping_K2DIV << 16 ) | ( SCU_PLL_PDIV << 24 ) );
                }
                else
                {
                    /* Setup devider settings for main PLL */
                    SCU_PLL->PLLCON1 = ( ( SCU_PLL_K1DIV ) | ( SCU_PLL_NDIV << 8 ) | ( SCU_PLL_K2DIV << 16 ) | ( SCU_PLL_PDIV << 24 ) );
                    SCU_TRAP->TRAPCLR = SCU_TRAP_TRAPCLR_SOSCWDGT_Msk | SCU_TRAP_TRAPCLR_SVCOLCKT_Msk; /* clear request for System OCS Watchdog Trap and System VCO Lock Trap  */
                    return( 1 );
                }

                /*********************************************************/
                /* Delay for next K2 step ~50탎 */
                /*********************************************************/
                SysTick->LOAD = ( ( 3000 + 100 ) & SysTick_LOAD_RELOAD_Msk ) - 1;
                SysTick->VAL = 0;                                  /* Load the SysTick Counter Value */
                SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk |
                                SysTick_CTRL_ENABLE_Msk;           /* Enable SysTick IRQ and SysTick Timer */

                while( SysTick->VAL >= 100 )                       /* wait for ~50탎  */
                {
                }

                SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;         /* Stop SysTick Timer */
                /********************************/

                /*********************************************************
                *   here the ramp up of the system clock starts FSys < 90MHz
                *********************************************************/
                if( CLOCK_FSYS > 90000000 )
                {
                    /*calulation for stepping*/
                    if( SCU_PLL_CLOCK_INPUT == SCU_CLOCK_CRYSTAL )
                    {
                        VCO = ( CLOCK_CRYSTAL_FREQUENCY / ( SCU_PLL_PDIV + 1 ) ) * ( SCU_PLL_NDIV + 1 );
                    }

                    if( ( SCU_PLL_CLOCK_INPUT == SCU_CLOCK_BACK_UP_AUTOMATIC ) || ( SCU_PLL_CLOCK_INPUT == SCU_CLOCK_BACK_UP_FACTORY ) )
                    {
                        VCO = ( CLOCK_BACK_UP / ( SCU_PLL_PDIV + 1 ) ) * ( SCU_PLL_NDIV + 1 );
                    }

                    stepping_K2DIV = ( VCO / 90000000 ) - 1;

                    /* Setup devider settings for main PLL */
                    SCU_PLL->PLLCON1 = ( ( SCU_PLL_K1DIV ) | ( SCU_PLL_NDIV << 8 ) | ( stepping_K2DIV << 16 ) | ( SCU_PLL_PDIV << 24 ) );
                }
                else
                {
                    /* Setup devider settings for main PLL */
                    SCU_PLL->PLLCON1 = ( ( SCU_PLL_K1DIV ) | ( SCU_PLL_NDIV << 8 ) | ( SCU_PLL_K2DIV << 16 ) | ( SCU_PLL_PDIV << 24 ) );
                    SCU_TRAP->TRAPCLR = SCU_TRAP_TRAPCLR_SOSCWDGT_Msk | SCU_TRAP_TRAPCLR_SVCOLCKT_Msk; /* clear request for System OCS Watchdog Trap and System VCO Lock Trap  */
                    return( 1 );
                }

                /*********************************************************/
                /* Delay for next K2 step ~50탎 */
                /*********************************************************/
                SysTick->LOAD = ( ( 4800 + 100 ) & SysTick_LOAD_RELOAD_Msk ) - 1;
                SysTick->VAL = 0;                                  /* Load the SysTick Counter Value */
                SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk |
                                SysTick_CTRL_ENABLE_Msk;           /* Enable SysTick IRQ and SysTick Timer */

                while( SysTick->VAL >= 100 )                       /* wait for ~50탎  */
                {
                }

                SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;         /* Stop SysTick Timer */
                /********************************/

                /* Setup devider settings for main PLL */
                SCU_PLL->PLLCON1 = ( ( SCU_PLL_K1DIV ) | ( SCU_PLL_NDIV << 8 ) | ( SCU_PLL_K2DIV << 16 ) | ( SCU_PLL_PDIV << 24 ) );

                SCU_TRAP->TRAPCLR = SCU_TRAP_TRAPCLR_SOSCWDGT_Msk | SCU_TRAP_TRAPCLR_SVCOLCKT_Msk; /* clear request for System OCS Watchdog Trap and System VCO Lock Trap  */
            }
        } /* end this weak function enables DAVE3 clock App usage */

        return( 1 );
    }
#endif /* if ( SCU_CLOCK_SETUP == 1 ) */

/**
 * @brief  -
 * @note   -
 * @param  None
 * @retval None
 */
#if ( SCU_USB_CLOCK_SETUP == 1 )
    static int USBClockSetup( void )
    {
/* this weak function enables DAVE3 clock App usage */
        if( AllowPLLInitByStartup() )
        {
            /* check if PLL is switched on */
            if( ( SCU_PLL->USBPLLCON & ( SCU_PLL_USBPLLCON_VCOPWD_Msk | SCU_PLL_USBPLLCON_PLLPWD_Msk ) ) != 0 )
            {
                /* enable PLL first */
                SCU_PLL->USBPLLCON &= ~( SCU_PLL_USBPLLCON_VCOPWD_Msk | SCU_PLL_USBPLLCON_PLLPWD_Msk );
            }

/* check and if not already running enable OSC_HP */
            if( SCU_OSC->OSCHPCTRL & SCU_OSC_OSCHPCTRL_MODE_Msk )
            {
                /* check if Main PLL is switched on for OSC WD*/
                if( ( SCU_PLL->PLLCON0 & ( SCU_PLL_PLLCON0_VCOPWD_Msk | SCU_PLL_PLLCON0_PLLPWD_Msk ) ) != 0 )
                {
                    /* enable PLL first */
                    SCU_PLL->PLLCON0 &= ~( SCU_PLL_PLLCON0_VCOPWD_Msk | SCU_PLL_PLLCON0_PLLPWD_Msk );
                }

