FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_Keil/System_XMC4500.c
                SCU_OSC->OSCHPCTRL &= ~( SCU_OSC_HP_MODE ); /*enable the OSC_HP*/
                /* setup OSC WDG devider */
                SCU_OSC->OSCHPCTRL |= ( SCU_OSCHPWDGDIV << 16 );
                /* restart OSC Watchdog */
                SCU_PLL->PLLCON0 &= ~SCU_PLL_PLLCON0_OSCRES_Msk;

                /* Timeout for wait loop ~150ms */
                /********************************/
                SysTick->LOAD = ( ( 5000000 + 100 ) & SysTick_LOAD_RELOAD_Msk ) - 1; /* set reload register */
                SysTick->VAL = 0;                                                    /* Load the SysTick Counter Value */
                SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk |
                                SysTick_CTRL_ENABLE_Msk;                             /* Enable SysTick IRQ and SysTick Timer */

                do
                {
                    /* wait for ~150ms  */
                } while( ( ( ( SCU_PLL->PLLSTAT ) & ( SCU_PLL_PLLSTAT_PLLHV_Msk | SCU_PLL_PLLSTAT_PLLLV_Msk | SCU_PLL_PLLSTAT_PLLSP_Msk ) ) != 0x380 ) && ( SysTick->VAL >= 500 ) );

                SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;         /* Stop SysTick Timer */

                if( ( ( SCU_PLL->PLLSTAT ) & ( SCU_PLL_PLLSTAT_PLLHV_Msk | SCU_PLL_PLLSTAT_PLLLV_Msk | SCU_PLL_PLLSTAT_PLLSP_Msk ) ) != 0x380 )
                {
                    return( 0 ); /* Return Error */
                }
            }

/* Setup USB PLL */
            /* Go to bypass the Main PLL */
            SCU_PLL->USBPLLCON |= SCU_PLL_USBPLLCON_VCOBYP_Msk;
            /* disconnect OSC_FI to PLL */
            SCU_PLL->USBPLLCON |= SCU_PLL_USBPLLCON_FINDIS_Msk;
            /* Setup devider settings for main PLL */
            SCU_PLL->USBPLLCON = ( ( SCU_USBPLL_NDIV << 8 ) | ( SCU_USBPLL_PDIV << 24 ) );
            /* Setup USBDIV settings USB clock */
            SCU_CLK->USBCLKCR = SCU_USBDIV;
            /* we may have to set OSCDISCDIS */
            SCU_PLL->USBPLLCON |= SCU_PLL_USBPLLCON_OSCDISCDIS_Msk;
            /* connect OSC_FI to PLL */
            SCU_PLL->USBPLLCON &= ~SCU_PLL_USBPLLCON_FINDIS_Msk;
            /* restart PLL Lock detection */
            SCU_PLL->USBPLLCON |= SCU_PLL_USBPLLCON_RESLD_Msk;

            /* wait for PLL Lock */
            while( !( SCU_PLL->USBPLLSTAT & SCU_PLL_USBPLLSTAT_VCOLOCK_Msk ) )
            {
            }
        } /* end this weak function enables DAVE3 clock App usage */

        return( 1 );
    }
#endif /* if ( SCU_USB_CLOCK_SETUP == 1 ) */
